cases/Chapter_6/OC6_III/pitchL35/0.orig/include/boundaryConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include "$FOAM_CASE/myVars" //Include global variables

flowVelocity         ($Ux 0 0);
pressure             0;
turbulentKE          #calc "1.5*pow($I*$Ux,2)" ; // 2% turbulence 

//https://www.cfd-online.com/Wiki/Turbulence_intensity
//https://www.openfoam.com/documentation/guides/latest/doc/guide-turbulence-ras-k-epsilon.html
//https://www.cfd-online.com/Wiki/Turbulence_free-stream_boundary_conditions

turbulentEpsilon     #calc "pow(0.09,0.75)*pow($turbulentKE,1.5)/$span"; // Was 2e-6 or 0.01; Guess ~ 0.09*k**(3/2)/l

// ************************************************************************* //
